app/controllers/books_controller.rb

INSERT INTO "books" ("title", "publisher_id", "proposal_date", "contract_date", "published_date", "units_sold", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    puts @book
    puts @book.valid?

    respond_to do |format|
      if @book.save